title: Download Cradles powershell
id: dc6d9254-4be4-11ed-bdc3-0242ac120002
status: experimental
description: detects when files are downloaded or executed using powershell cradles
author: 'sansan'
references: 
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=56
    - https://gist.github.com/HarmJ0y/bb48307ffa663256e239
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
       CommandLine|contains:
         - 'DownloadString'
         - 'Net.Webclient'
         - 'DownloadFile'
         - 'DownloadData'
         - 'FtpWebRequest'
         - 'WinHttp.WinHttpRequest'
         - 'System.Xml.XmlDocument'
         - 'DownloadDataAsync'
         - 'DownloadDataTaskAsync'
         - 'DownloadFileAsync'
         - 'DownloadFileAsync'
         - 'OpenReadAsync'
         - 'OpenReadTaskAsync'
         - 'System.Net.WebRequest'
         - 'System.Net.HttpWebRequest'
         - 'System.Net.FileWebRequest'
         - 'System.Net.FtpWebRequest'
         - 'Invoke-WebRequest'
         - 'IEX (iwr'
         - 'Invoke-Expression (iwr'
         - 'curl'
         - 'wget'
         - 'Invoke-RestMethod'
         - 'IEX (irm'
         - 'Invoke-Expression (irm'
         - 'InternetExplorer.Application'
         - 'Msxml2.XMLHTTP'
         - 'Msxml2.ServerXmlHttp'
         - 'WinHttp.WinHttpRequest'
         - 'Word.Application'
         - 'Excel.Application'
         - 'System.Xml.XmlDocument'
         - 'Start-BitsTransfer '
    selection2:
        CommandLine|contains:
          - 'http'
          - 'ftp'
    condition: selection1 AND selection2
falsepositives:
    - Unknow
level: medium
