title: sharpwsus_hackTool
id:25f40436-8d9a-48db-9ef2-b2ea3cd25690
status: Experimental
description:detects malicious activity when an attacker utilizes the tool sharpwsus via PE information of command line parameters
author:sansan
tags:
  - attack.execution
  - attack.t1059
  - attack.lateral_movement
  - attack.t1570
references:
  - https://github.com/nettitude/SharpWSUS
  - https://labs.nettitude.com/blog/introducing-sharpwsus/
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    - Image|endswith: 'SharpWSUS.exe'
    - OriginalFileName: 'SharpWSUS.exe'
    - Description: 'SharpWSUS'
  selection2:
    CommandLine|contains:
      - 'locate'
      - 'check'
      - 'create'
      - 'payload'
      - 'approve'
      - 'delete'
      - 'inspect'
      - 'updateid'
      - 'computername'
      - 'groupname'
      - 'approver'
      - 'args'
      - 'date'
      - 'rating'
      - 'msrc'
      - 'description'
      - 'url'
      - 'kb'
  condition: selection1 AND selection2
falsepositives:
  - Unlikely
level: critical
