title: wmic Execute process local
id: 230ee119-03d9-4b18-a2d9-08a6e27a51f7
status: Experimental
description: detects when wmic is executed for create a new process
author: sansan
tags:
  - attack.Execution
references:
  - https://redcanary.com/threat-detection-report/techniques/windows-management-instrumentation/
  - https://atomicredteam.io/execution/T1047/#atomic-test-5---wmi-execute-local-process
  - https://dmcxblue.gitbook.io/red-team-notes-2-0/red-team-techniques/execution/t1047-windows-management-instrumentation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
      - 'wmic'
      - 'process'
      - 'call'
      - 'create'      
  condition: selection
falsepositives:
  - Unlikely
level: High
