title: wmic Execute process local
id: 230ee119-03d9-4b18-a2d9-08a6e27a51f7
status: Experimental
description: detects when wmic is executed for create a new process
author: sansan
tags:
  - attack.Execution
references:
  - 
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    CommandLine|contains|all:
      - 'wmic'
      - 'process'
      - 'call'
      - 'create'      
  condition: selection1 
falsepositives:
  - Unlikely
level: High
