title: conhost_proxy_execution
id: 3180ea04-4c06-11ed-bdc3-0242ac120002
description: Detects when an attacker tries evade relationship parente-child
status: stable
author: sansan
references:
    - https://twitter.com/Wietze/status/1511397781159751680
    - https://github.com/LOLBAS-Project/LOLBAS/pull/201/files
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        ParentImage|endswith: 
        - 'conhost.exe'
    selection2:
        Image|endswith: 
        - '*.exe'
    condition: (selection1 and selection2)
falsepositives:
    - Unknow
level: high
